airFoil3D_files/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type        forceCoeffs;

    libs ( "libforces.so" );

    writeControl    timeStep;
    timeStep    100;

    log         yes;

    patches     (walls);
    pRef        0;
    rho         rhoInf;      // Indicates incompressible
    rhoInf      1.225;           // Redundant for incompressible
    liftDir     (-0.25819  0.965926 0);
    dragDir     (0.965926 0.25819 0);
    CofR        (1.64578 0 0);  // Axle midpoint on ground
    pitchAxis   (0 0 1);
    magUInf     2.9612;
    lRef        1;        // Wheelbase length
    Aref        5;        // Estimated 
    tolerance   1e-3;
}


// ************************************************************************* //
